app/views/dashboard/index.html.erb

SELECT COUNT(*) FROM `clients`
---
              <div class="col-xs-9 text-right">
                <div class="huge"><%= Client.all.count %></div>

SELECT COUNT(*) FROM `contacts`
---
              <div class="col-xs-9 text-right">
                <div class="huge"><%= Contact.all.count %></div>