app/views/clients/_form.html.erb

SELECT `countries`.* FROM `countries`
---
    <div class="col-sm-6">
      <%= f.collection_select :country_id, Country.all, :id, :name,  {prompt: '- Select a country -'}, class: "form-control validate[required]" %>