app/controllers/clients_controller.rb

  def index
    search = Client.search do
---
SELECT `clients`.* FROM `clients`

  def create
    @client = Client.new(client_params)
    respond_to do |format|
      if @client.save
---
INSERT INTO `clients` (`name`, `address`, `country_id`, `legalid`, `slug`, `created_at`, `updated_at`) VALUES (' Client', 'dsada', 1, 'asda', 'client', '2015-02-27 13:18:53.578553', '2015-02-27 13:18:53.578553')

    def set_client
      @client = Client.find(params[:id])
---
SELECT `clients`.* FROM `clients` WHERE `clients`.`id` IN (1, 2, 3, 9)