app/controllers/contacts_controller.rb

SELECT `contacts`.* FROM `contacts`
---
  def index
    @contacts = Contact.all

INSERT INTO `contacts` (`name`, `email`, `phone`, `mobile`, `client_id`, `birthday`, `slug`, `created_at`, `updated_at`) VALUES ('a', 'a', 0, 0, 9, '2015-02-27', 'a', '2015-02-27 14:28:14.675432', '2015-02-27 14:28:14.675432')
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save