app/controllers/countries_controller.rb

  def index
    @countries = Country.paginate(page: params[:page], per_page: 10)
---
SELECT COUNT(*) FROM `countries`
SELECT `countries`.* FROM `countries`

  def create
    @country = Country.new(country_params)

    respond_to do |format|
      if @country.save
---
INSERT INTO `countries` (`name`, `slug`, `created_at`, `updated_at`) VALUES ('', 'afffb506-ca01-4e5a-a9b6-e1d8bb7a934b', '2015-02-27 13:49:28.227423', '2015-02-27 13:49:28.227423')

  def update
    respond_to do |format|
      if @country.update(country_params)
---
UPDATE `countries` SET `is_invoice` = 0, `updated_at` = '2015-02-27 16:28:19' WHERE `countries`.`id` = 7

  def destroy
    @country.destroy
---
DELETE FROM `countries` WHERE `countries`.`id` = 6